{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"hide_heading":false}},"7d382dbe-c5a3-49fc-856d-1de9bb5a23b8":{"type":"media-with-text","blocks":{"template--16159801278630__7d382dbe-c5a3-49fc-856d-1de9bb5a23b8-heading-1":{"type":"heading","settings":{"heading":"About Us"}},"template--16159801278630__7d382dbe-c5a3-49fc-856d-1de9bb5a23b8-text-1":{"type":"text","settings":{"text":"<h3><\/h3><h3>Hero LifeCare Inc. is a leading provider of first aid, emergency response, workplace safety, and healthcare solutions. The company develops advanced products, devices, and software to enhance risk management, improve efficiency, and create safer, more productive environments.  By integrating robotics, AI, and smart technologies, Hero LifeCare helps organizations prevent injuries, reduce incidents, accelerate response times, and ensure safety compliance. As the manufacturer of the R15—the only publicly accessible oxygen solution—the company is dedicated to improving lives through innovation in everything it does.<br\/><\/h3><h3>In 2023, Hero LifeCare acquired Rapid Oxygen (RO2), which manufactures and markets the R15, an FDA cleared first aid emergency oxygen device developed in conjunction with the U. of Michigan. Hero sells this first aid oxygen as well as other products through herolifecare.com. <\/h3><h3>The R15 provides rapid response oxygen for breathing related and cardiac emergencies, operable by any Good Samaritan without certification or training.  The R15 provides 100% Oxygen - safe, portable, non-explosive oxygen, permitted anywhere, even in public areas where oxygen cylinders are restricted by law. The R15 is cleared by the FDA for emergency use as an Over-the-Counter (OTC) device, eliminating the need for a medical prescription as required for oxygen cylinders.<\/h3>"}}},"block_order":["template--16159801278630__7d382dbe-c5a3-49fc-856d-1de9bb5a23b8-heading-1","template--16159801278630__7d382dbe-c5a3-49fc-856d-1de9bb5a23b8-text-1"],"settings":{"image":"shopify:\/\/shop_images\/RO2_About_Us_Pic_3.jpg","video_url":"","layout":"media_first","desktop_content_alignment":"left","color_scheme":"background-1","spacing_top":14,"spacing_bottom":14}}},"order":["main","7d382dbe-c5a3-49fc-856d-1de9bb5a23b8"]}