{"sections":{"d352e3c1-d482-4b38-ab25-5cf92f45ce33":{"type":"media-with-text","blocks":{"template--16119386407078__d352e3c1-d482-4b38-ab25-5cf92f45ce33-heading-1":{"type":"heading","settings":{"heading":"Our Story"}},"template--16119386407078__d352e3c1-d482-4b38-ab25-5cf92f45ce33-text-1":{"type":"text","settings":{"text":"<h5>Hero recently acquired Rapid Oxygen (RO2), which manufactures and markets the R15, an FDA cleared first aid emergency oxygen device developed in conjunction with the U. of Michigan. Hero sells this first aid oxygen as well as other products through herolifecare.com, our ecommerce site. <\/h5><h5>Rapid Oxygen developed and patented the R15, a rapid response oxygen technology for airway and cardiac emergencies, operable by any Good Samaritan without certification or training.  The R15 provides 100% Oxygen - safe, portable, non-explosive oxygen, permitted anywhere, even in public areas where oxygen cylinders are restricted by law. The R15 is cleared by the FDA for emergency use as an Over-the-Counter (OTC) device, eliminating the need for a medical prescription as required for oxygen cylinders.<\/h5><h5>Hero is also developing the Smart Hero Station, which is intended to drastically improve public safety and provide a rapid response to emergencies in airports, schools, and everywhere!  The products we manufacture are included at herotechlabs.com, our distributor focused site.  We will continue to develop products based on improving safety, health and wellness as we believe technology has that power!<\/h5><h5>Hero is focused on selling safety, health, and wellness products.  We also will be launching a concierge service to introduce new innovative products to fit a member’s need that might not have been discovered otherwise.  Our focus is to improve health and help save lives!<\/h5><h5>Please email us at <strong>ideas@herolifecare.com<\/strong> with any ideas or existing products you would like to see included at herolifecare.com and thank you in advance for your help!<\/h5>"}}},"block_order":["template--16119386407078__d352e3c1-d482-4b38-ab25-5cf92f45ce33-heading-1","template--16119386407078__d352e3c1-d482-4b38-ab25-5cf92f45ce33-text-1"],"disabled":true,"settings":{"image":"shopify:\/\/shop_images\/RO2_About_Us_Pic_3.jpg","video_url":"","layout":"media_first","desktop_content_alignment":"left","color_scheme":"background-1","spacing_top":16,"spacing_bottom":16}},"main":{"type":"main-page","settings":{}}},"order":["d352e3c1-d482-4b38-ab25-5cf92f45ce33","main"]}